export const 간파 = [
  0,
  0, // Lv 1
  45, // Lv 2
  75, // Lv 3
  120, // Lv 4
  200, // Lv 5
  325, // Lv 6
  540, // Lv 7
  0, // Lv 8
  0, // Lv 9
  0, // Lv 10
  0, // Lv 11
].map((n, i) => `간파 Lv${i} : 적 막기, 회피 시 생명력 ${n} 회복, 치명타 2회`);

export const 강타 = [
  0,
  0, // Lv 1
  7, // Lv 2
  9, // Lv 3
  13, // Lv 4
  17, // Lv 5
  23, // Lv 6
  32, // Lv 7
  0, // Lv 8
  0, // Lv 9
  0, // Lv 10
  0, // Lv 11
].map((n, i) => `강타 Lv${i} : 공격력 ${n} 증가`);

export const 끈기 = [
  0,
  0, // Lv 1
  300, // Lv 2
  0, // Lv 3
  810, // Lv 4
  1350, // Lv 5
  2220, // Lv 6
  3660, // Lv 7
  6060, // Lv 8
  0, // Lv 9
  0, // Lv 10
  0, // Lv 11
].map((n, i) => `끈기 Lv${i} : 피격 시 일정 확률로 생명력 ${n} 회복`);

export const 맹격 = [
  0,
  0, // Lv 1
  290, // Lv 2
  395, // Lv 3
  535, // Lv 4
  730, // Lv 5
  995, // Lv 6
  1360, // Lv 7
  1850, // Lv 8
  0, // Lv 9
  0, // Lv 10
  3760, // Lv 11
].map((n, i) => `맹격 Lv${i} : 공격 시 일정 확률로 치명타 3회, 추가피해 ${n}`);

export const 약점방어 = [
  [0, 0],
  [0, 0], // Lv 1
  [200, 70], // Lv 2
  [0, 0], // Lv 3
  [540, 145], // Lv 4
  [900, 195], // Lv 5
  [1480, 270], // Lv 6
  [2440, 375], // Lv 7
  [0, 0], // Lv 8
  [0, 0], // Lv 9
].map((n, i) => `약점 방어 Lv${i} : 피격 시 일정 확률로 8초 동안 생명력 ${n[0]} 회복, 치명방어 ${n[1]} 증가`);

export const 환기 = [
  [0, 0],
  [140, 40], // Lv 1
  [0, 0], // Lv 2
  [220, 50], // Lv 3
  [360, 75], // Lv 4
  [600, 105], // Lv 5
  [980, 150], // Lv 6
  [1620, 215], // Lv 7
  [0, 0], // Lv 8
  [3860, 400], // Lv 9
].map((n, i) => `환기 Lv${i} : 회피, 막기 시 8초동안 생명력 ${n[0]} 회복, 회복 ${n[1]} 증가`);

export const 흡수 = [
  0,
  11, // Lv 1
  18, // Lv 2
  30, // Lv 3
  48, // Lv 4
  80, // Lv 5
  130, // Lv 6
  0, // Lv 7
  0, // Lv 8
  0, // Lv 9
  630, // Lv 10
  765, // Lv 11
].map((n, i) => `흡수 Lv${i} : 치명타 시 흡혈 ${n}`);

export default {
  간파,
  강타,
  끈기,
  맹격,
  약점방어,
  환기,
  흡수
}